In [10]:
import pandas as pd
import numpy as np
train = pd.read_csv('http://bit.ly/kaggletrain')

In [11]:
#map to new col
train['new'] =  train.Sex.map({'female':0,'male':1})

In [12]:
train.loc[0:5,['Sex','new']]

      Sex  new
0    male    1
1  female    0
2  female    0
3  female    0
4    male    1
5    male    1

In [3]:
#apply to each element in col
train['Len_Name'] = train.Name.apply(len)

NameError: name 'train' is not defined

In [15]:
train.loc[0:5,['Name','Len_Name']]

                                                Name  Len_Name
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)        44
4                           Allen, Mr. William Henry        24
5                                   Moran, Mr. James        16

In [18]:
train['Ceil_Fair'] = train.Fare.apply(np.ceil)

In [19]:
train.loc[0:5,['Fare','Ceil_Fair']]

      Fare  Ceil_Fair
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0
4   8.0500        9.0
5   8.4583        9.0

In [5]:
#train.Name.str.split(",").apply(lambda x:x[0]) or 
newl = train.Name.str.split(",")
newl

0                             [Braund,  Mr. Owen Harris]
1      [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                              [Heikkinen,  Miss. Laina]
3        [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                            [Allen,  Mr. William Henry]
                             ...
886                             [Montvila,  Rev. Juozas]
887                      [Graham,  Miss. Margaret Edith]
888          [Johnston,  Miss. Catherine Helen "Carrie"]
889                             [Behr,  Mr. Karl Howell]
890                               [Dooley,  Mr. Patrick]
Name: Name, Length: 891, dtype: object

In [31]:
newl.apply(lambda x:x[0])

0         Braund
1        Cumings
2      Heikkinen
3       Futrelle
4          Allen
         ...
886     Montvila
887       Graham
888     Johnston
889         Behr
890       Dooley
Name: Name, Length: 891, dtype: object

In [32]:
drinks =  pd.read_csv("http://bit.ly/drinksbycountry")

In [33]:
drinks.loc[:,['beer_servings','wine_servings']].apply(max)

beer_servings    376
wine_servings    370
dtype: int64

In [37]:
#as dataframe and argmax display which col is max----np.argmax
drinks.loc[:,'beer_servings':'wine_servings'].apply(max,axis=1)

0        0
1      132
2       25
3      312
4      217
      ...
188    333
189    111
190      6
191     32
192     64
Length: 193, dtype: int64

In [43]:
drinks.loc[:,'beer_servings':'wine_servings']=drinks.loc[:,'beer_servings':'wine_servings'].applymap(float)

In [44]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,0.0,0.0,0.0,Asia
1,Albania,89.0,132.0,54.0,4.9,Europe
2,Algeria,25.0,0.0,14.0,0.7,Africa
3,Andorra,245.0,138.0,312.0,12.4,Europe
4,Angola,217.0,57.0,45.0,5.9,Africa

In [45]:
st = pd.read_csv("http://bit.ly/smallstocks")

In [46]:
st

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [48]:
st.groupby('Symbol').Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [53]:
muli=st.groupby(['Symbol','Date']).Close.mean()

In [54]:
#multiindex
muli.index

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

In [66]:
muli.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [63]:
#or this..........
df = st.pivot_table(values='Close' , index='Symbol' , columns='Date')
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [65]:
#row
df.loc['AAPL','2016-10-05']
#col
df.loc[:,'2016-10-05']

Symbol
AAPL    113.05
CSCO     31.59
MSFT     57.64
Name: 2016-10-05, dtype: float64

In [69]:
st = pd.read_csv("http://bit.ly/smallstocks")
st.set_index(['Symbol','Date'],inplace=True)
st

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [71]:
st.sort_index(inplace=True)
st

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [72]:
st.loc[('CSCO','2016-10-03'),:]

Close           31.5
Volume    14070500.0
Name: (CSCO, 2016-10-03), dtype: float64

In [73]:
st.loc[(['AAPL','CSCO'],'2016-10-03'),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
CSCO   2016-10-03   31.50  14070500

In [74]:
st.loc[(slice(None),['2016-10-03','2016-10-04']),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900

In [ ]:
# merge here close and vol are df with same multiindex but distince col
# both = pd.merge(close,vol,left_index=True,left_on=True,right_on=True,right_index=False)
# both.reset_index()